In [1]:
import pandas as pd

In [2]:
df_cars = pd.read_csv("data/cars.csv")

In [3]:
df_cars

      Brand  Color    Cost
0       BMW    Red   40000
1    Toyota  Black   25000
2     Honda  White   27000
3   Ferrari    Red  300000
4  Maserati  White  120000

In [4]:
df_cars1 = pd.read_csv("data/cars.csv",nrows = 2)

In [5]:
df_cars1

    Brand  Color   Cost
0     BMW    Red  40000
1  Toyota  Black  25000

In [8]:
df_cars2 = pd.read_csv("data/cars_no_header.csv",header=None)

In [9]:
df_cars2

          0      1       2
0       BMW    Red   40000
1    Toyota  Black   25000
2     Honda  White   27000
3   Ferrari    Red  300000
4  Maserati  White  120000

In [10]:
df_json = pd.read_json("data/numbers.json")

In [11]:
df_json

   Column 1  Column 2
0         1         2
1         3         4
2         5         6

In [15]:
df_cars2.to_csv("data/Cars.csv",index = False)

In [16]:
df_cars3 = pd.read_csv("data/Cars.csv")

In [17]:
df_cars3

          0      1       2
0       BMW    Red   40000
1    Toyota  Black   25000
2     Honda  White   27000
3   Ferrari    Red  300000
4  Maserati  White  120000